# CannotSlantAnalyticalWallError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..CannotSlantAnalyticalWallError Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Cannot slant a wall with an Analytical Model. Please disable the Analytical Model first.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotSlantAnalyticalWallError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotSlantAnalyticalWallError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotSlantAnalyticalWallError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace